app/templateFolder/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
	p
	{
		solver			GAMG;
		tolerance		1e-06;
		relTol			0.1;
		smoother		GaussSeidel;
	}

	"(U|k|epsilon|omega|gammaInt|ReThetat|v2|f)"
	{
		solver			smoothSolver;
		smoother		GaussSeidel;
		nSweeps			2;
		tolerance		1e-08;
		relTol			0.1;
	}

	nuTilda
	{
		solver			smoothSolver;
		smoother		GaussSeidel;
		nSweeps			2;
		tolerance		1e-08;
		relTol			0.1;
	}
}

SIMPLE
{
	nNonOrthogonalCorrectors	0;
	consistent		yes;

	residualControl
	{
		p				1e-05;
		U				1e-05;
		nuTilda			1e-05;
	  "(k|epsilon|omega|gammaInt|ReThetat|v2|f)"  1e-05;
	}
}

relaxationFactors
{
	fields
	{
		p				0.3;

	}
	equations
	{
		U				0.7;
		nuTilda			0.7;
		k				0.7;
		omega				0.7;
		epsilon				0.6;
		gammaInt			0.7;
		ReThetat			0.7;
	}
}
// ************************************************************************* //